Tekla Open API Reference for Tekla Structures 2025
Model.GetReportPropertyInt Method
 Get a list of property values, where the property is of type interger, for the given identifiers.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<int> GetReportPropertyInt(
	IList<Identifier> identifiers,
	string property
)
Public Function GetReportPropertyInt (
	identifiers As IList(Of Identifier),
	property As String
) As List(Of Integer)
Parameters
identifiers
Type: System.Collections.Generic.IList<Identifier>
The list of identifiers to get the property for.
property
Type: System.String
The name of the property to get.
Return Value
Type: List<Int32>
The integer values of the property for the given identifiers.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace